{
  "connectWallet": "Подключить кошелек",
  "disconnectWallet": "Отключить кошелек",
  "welcome": "Добро пожаловать в airdrop токенов журнала local!",
  "welcomeMessageNoWallet": "Пожалуйста, подключите свой кошелек, чтобы продолжить. Внизу страницы есть инструкция",
  "noCode": "Чтобы получить токены, у вас должен быть действительный код.",
  "connected": "Подключите кошелек",
  "claiming": "Получаем токены...",
  "claimed": "Токены получены!",
  "claimedAlready": "Код уже использован!",
  "claim": "Получить токены",
  "invalidCode": "Недействительный код!",
  "wait": "Подождите...",
  "somethingWentWrong": "Что-то пошло не так",
  "intro": "Это Airdrop токенов (Local Zin Token), выпущенных к 7 выпуску журнала local за май 2025. Поздравляем теперь ты тоже немного криптан.",
  "readyToClaim": "Ваш код зарегистрирован в контракте и Вы можете получить токены.",
  "confirmTheTransaction": "Подтвердите транзакцию в кошельке (он должен открыться автоматически).",
  "codeHasBeenUsed": "Этот код уже был однажды использован :(",
  "codeNotFound": "Код, который вы использовали при переходе в dApp, не зарегистрирован в контракте. Провертье Ваш QR-код.",
  "checkNetworkIfWaitingTooLong": "Проверьте, что вы подключены к правильной сети (Arbitrum One) и используете правильный код.",
  "transactionFailed": "Транзакция не удалась. Проверьте баланс, сеть и всё вот это (отключите кошелёк чтобы увидеть инструкцию).",
  "transactionSuccess": "Транзакция прошла успешно. Вы можете проверить её на блокчейне",
  "setupTitle": "Инструкция",
  "setupIntro": "Для получения токенов вам потребуется любой Ethereum-совместимый кошелёк с поддержкой сети Arbitrum One. В примере ниже используется MetaMask.",
  "step1": "Шаг 1. Установите расширение MetaMask для браузера.",
  "metamaskGuide": "Официальная инструкция по установке MetaMask",
  "seedPhraseReminder": "Надеемся, вы переписали свою seed-фразу на бумагу и НЕ сделали фото, которое может оказаться в облаке.",
  "step2Intro": "Шаг 2. Пополните кошелёк небольшим количеством ETH (зависит от нагрузки сети, порядка $0.02) в сети Arbitrum One для оплаты fee за транзакцию. Это можно сделать через биржи:",
  "step2Exchanges": "Так же можно воспользоваться агрегаторами и обменниками криптовалют. Обязательно проверяйте отзывы и репутацию выбранного сервиса перед обменом.",
  "step2BridgePrefix": "Если у вас уже есть ETH в сети Ethereum Mainnet, вы можете воспользоваться официальным мостом",
  "step2BridgeSuffix": "для перевода средств в Arbitrum One.",
  "step2SelectNetwork": "Незабудьте выбрать сеть Arbitrum One в MetaMask и проверить баланс.",
  "readyToConnect": "Если всё готово нажимайте кнопку вверху страницы, чтобы подключить кошелёк."
}